Reposti/app/views/api/posts/show.json.jbuilder

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 4]]
---
    json.partial! 'api/posts/post', post: @post
    json.likes @post.likes.map(&:id)