Reposti/app/models/like.rb

SELECT  "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."liker_id" = $2 LIMIT $3  [["post_id", 1], ["liker_id", 1], ["LIMIT", 1]]
---
  def liked
    lik = Like.find_by(liker_id: self.liker_id, post_id: self.post_id)