Reposti/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]
---
  def self.find_by_credentials(user_params)
    user = User.find_by(username: user_params[:username])

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "yDFaPLxz2d-lBr77iQcRaw"], ["updated_at", "2020-03-03 04:56:25.203332"], ["id", 1]]
---
  def reset_session_token!
    self.update!(session_token: SecureRandom::urlsafe_base64)