Reposti/app/controllers/api/follows_controller.rb

  def create
    @follow = Follow.new(follow_params)

    if @follow.save
---
INSERT INTO "follows" ("leader_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["leader_id", 3], ["follower_id", 1], ["created_at", "2020-03-03 05:02:27.713281"], ["updated_at", "2020-03-03 05:02:27.713281"]]

  def destroy
    @follow = Follow.find_by(id: params[:id])

    if @follow
      @follow.destroy
---
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 5]]