Reposti/app/controllers/api/likes_controller.rb

  def create
    @like = Like.new(like_params)

    if @like.save
---
INSERT INTO "likes" ("post_id", "liker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["liker_id", 1], ["created_at", "2020-03-03 19:41:25.966103"], ["updated_at", "2020-03-03 19:41:25.966103"]]

  def destroy
    @like = Like.find_by(id: params[:id])

    if @like
      @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]