Reposti/app/controllers/api/posts_controller.rb

  def index
    @posts = Post.all.includes(:author).includes(:likes).includes(:likers)
---
SELECT "posts".* FROM "posts"

  def show
    @post = Post
              .includes(:author)
              .includes(:likes)
              .includes(:likers)
              .find_by(id: params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 3]]

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("post_type_id", "title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["post_type_id", 1], ["title", "Postman Post"], ["body", "This is a postman post"], ["author_id", 3], ["created_at", "2020-03-04 00:54:02.209045"], ["updated_at", "2020-03-04 00:54:02.209045"]]

  def update
    if post_id
      @post = Post.find_by(id: post_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def destroy
    @post = Post.find_by(id: post_id)
    if @post
      @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]