Reposti/app/controllers/api/posts_controller.rb

  def show
    @post = Post.includes(:author).find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]