Reposti/app/controllers/api/sessions_controller.rb

  def create
    @user = User
              .includes(:posts)
              .includes(:followers)
              .includes(:leaders)
              .includes(:leaders_link)
              .includes(:followers_link)
              .includes(:followed_posts)
              .includes(:likes)
              .includes(:liked_posts)
              .find_by_credentials(user_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN ($1, $2, $3)  [["id", 2], ["id", 3], ["id", 1]]