Reposti/app/controllers/api/users_controller.rb

  def show
    if user_username
      @user = User.includes(:posts).includes(:followers).includes(:leaders).find_by(username: user_username)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN ($1, $2, $3)  [["id", 2], ["id", 3], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "login"], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"