app/views/api/users/_user.json.jbuilder

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 1]]
---
json.likes user.likes.map(&:id)
json.followers user.followers_link.map(&:id)