Reposti/app/views/api/users/show.json.jbuilder

    json.posts @user.posts.sort {|a, b| b.created_at <=> a.created_at}.map(&:id)
    json.followers @user.followers_link.sort {|a, b| b.created_at <=> a.created_at}.map(&:id)
---
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 1]]

json.follows do
  (@user.followers_link + @user.leaders_link).uniq.each do |link|
---
SELECT "follows".* FROM "follows" WHERE "follows"."leader_id" = $1  [["leader_id", 1]]